src/DataProcessors/Скаут/Скаут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Скаут</name>
</mdclass:DataProcessor>

src/InformationRegisters/ПоложениеТехникиСкаут/ПоложениеТехникиСкаут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоложениеТехникиСкаут</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодТипаТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Азимут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Скорость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоординатаX</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоординатаY</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/Скаут/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает координаты доступной техники из Скаут-онлайн API.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Идентификатор, Наименование, ГосНомер, КодТипаТС, ТипТС, Широта, Долгота, Азимут, Скорость.
Функция ПолучитьКоординатыТехники() Экспорт

	Токен = ПолучитьТокенАвторизации();
	Возврат ЗапроситьНавигационныеДанные(Токен);

КонецФункции

// Записывает снимок положения техники в периодический регистр сведений.
//
// Параметры:
//  ТаблицаКоординат - ТаблицаЗначений - строки, полученные ПолучитьКоординатыТехники.
Процедура ЗаписатьПоложениеТехники(ТаблицаКоординат) Экспорт

	ДатаПолучения = ТекущаяДатаСеанса();
	НаборЗаписей = РегистрыСведений.ПоложениеТехникиСкаут.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ДатаПолучения);

	Для Каждого СтрокаТаблицы Из ТаблицаКоординат Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Идентификатор) Тогда
			Продолжить;
		КонецЕсли;

		КоординатыСцены = КоординатыСценыКарты(СтрокаТаблицы.Широта, СтрокаТаблицы.Долгота);
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ДатаПолучения;
		Запись.Идентификатор = СтрокаТаблицы.Идентификатор;
		Запись.Наименование = СтрокаТаблицы.Наименование;
		Запись.ГосНомер = СтрокаТаблицы.ГосНомер;
		Запись.КодТипаТС = СтрокаТаблицы.КодТипаТС;
		Запись.ТипТС = СтрокаТаблицы.ТипТС;
		Запись.Широта = СтрокаТаблицы.Широта;
		Запись.Долгота = СтрокаТаблицы.Долгота;
		Запись.Азимут = СтрокаТаблицы.Азимут;
		Запись.Скорость = СтрокаТаблицы.Скорость;
		Запись.КоординатаX = КоординатыСцены.x;
		Запись.КоординатаY = КоординатыСцены.y;
		Запись.ДатаПолучения = ДатаПолучения;
	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТокенАвторизации()

	ЛогинСкаут = СокрЛП(Строка(Константы.ЛогинСкаут.Получить()));
	ПарольСкаут = Строка(Константы.ПарольСкаут.Получить());
	Если ПустаяСтрока(ЛогинСкаут) Тогда
		ВызватьИсключение "Не заполнена константа ""Логин Скаут"".";
	КонецЕсли;
	Если ПустаяСтрока(ПарольСкаут) Тогда
		ВызватьИсключение "Не заполнена константа ""Пароль Скаут"".";
	КонецЕсли;

	ТелоЗапроса = СтрШаблон(
		"grant_type=password&username=%1&password=%2",
		КодироватьСтроку(ЛогинСкаут, СпособКодированияСтроки.КодировкаURL),
		КодироватьСтроку(ПарольСкаут, СпособКодированияСтроки.КодировкаURL));

	Запрос = Новый HTTPЗапрос("/api/auth/token");
	Запрос.Заголовки.Вставить("Authorization", "Basic OGIxZmQ3MDQtMDk2ZS00MmQ2LTliYTUtNmQ5ODk4MGU3Y2QxOg==");
	Запрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);

	Ответ = СоединениеАпи().ВызватьHTTPМетод("POST", Запрос);
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	ПроверитьКодОтвета(Ответ, ТелоОтвета, "авторизации");

	Данные = ПрочитатьJSONИзСтроки(ТелоОтвета);
	Токен = ЗначениеПоля(Данные, "access_token");
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ВызватьИсключение "Сервис Скаут не вернул токен авторизации.";
	КонецЕсли;

	Возврат Токен;

КонецФункции

Функция ЗапроситьНавигационныеДанные(Токен)

	Адрес = "/api/v3/online-data/units-navigation";

	Запрос = Новый HTTPЗапрос(Адрес);
	Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);

	Ответ = СоединениеАпи().ВызватьHTTPМетод("GET", Запрос);
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();

	Таблица = НоваяТаблицаКоординат();
	Если Ответ.КодСостояния = 204 Или ПустаяСтрока(ТелоОтвета) Тогда
		Возврат Таблица;
	КонецЕсли;

	ПроверитьКодОтвета(Ответ, ТелоОтвета, "координат техники");

	Данные = ПрочитатьJSONИзСтроки(ТелоОтвета);
	Если ТипЗнч(Данные) <> Тип("Массив") Тогда
		ВызватьИсключение "Сервис Скаут вернул неожиданный формат координат.";
	КонецЕсли;

	Для Каждого Элемент Из Данные Цикл
		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.Идентификатор = ЧислоИзПоля(Элемент, "id");
		СтрокаТаблицы.Наименование = СтрокаИзПоля(Элемент, "unitName");
		СтрокаТаблицы.ГосНомер = СтрокаИзПоля(Элемент, "stateNumber");
		КодТипаТС = ЧислоИзПоля(Элемент, "unitType");
		СтрокаТаблицы.КодТипаТС = КодТипаТС;
		СтрокаТаблицы.ТипТС = ПредставлениеТипаТС(КодТипаТС);
		СтрокаТаблицы.Широта = ЧислоИзПоля(Элемент, "lat");
		СтрокаТаблицы.Долгота = ЧислоИзПоля(Элемент, "lon");
		СтрокаТаблицы.Азимут = ЧислоИзПоля(Элемент, "angle");
		СтрокаТаблицы.Скорость = ЧислоИзПоля(Элемент, "speed");
	КонецЦикла;

	Возврат Таблица;

КонецФункции

Функция СоединениеАпи()

	Возврат Новый HTTPСоединение("api.scout-gps.ru", 443, , , , 60, Новый ЗащищенноеСоединениеOpenSSL);

КонецФункции

Функция НоваяТаблицаКоординат()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	Таблица.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	Таблица.Колонки.Добавить("ГосНомер", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
	Таблица.Колонки.Добавить("КодТипаТС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	Таблица.Колонки.Добавить("ТипТС", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	Таблица.Колонки.Добавить("Широта", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 10)));
	Таблица.Колонки.Добавить("Долгота", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 10)));
	Таблица.Колонки.Добавить("Азимут", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
	Таблица.Колонки.Добавить("Скорость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
	Возврат Таблица;

КонецФункции

Процедура ПроверитьКодОтвета(Ответ, ТелоОтвета, ИмяОперации)

	Если Ответ.КодСостояния < 200 Или Ответ.КодСостояния >= 300 Тогда
		ВызватьИсключение СтрШаблон(
			"Ошибка %1 Скаут: HTTP %2. %3",
			ИмяОперации,
			Ответ.КодСостояния,
			ТелоОтвета);
	КонецЕсли;

КонецПроцедуры

Функция ПрочитатьJSONИзСтроки(Текст)

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Текст);
	Данные = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	Возврат Данные;

КонецФункции

Функция ЗначениеПоля(Элемент, ИмяПоля)

	Если ТипЗнч(Элемент) = Тип("Структура") Тогда
		Значение = Неопределено;
		Элемент.Свойство(ИмяПоля, Значение);
		Возврат Значение;
	ИначеЕсли ТипЗнч(Элемент) = Тип("Соответствие") Тогда
		Возврат Элемент.Получить(ИмяПоля);
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ЧислоИзПоля(Элемент, ИмяПоля)

	Значение = ЗначениеПоля(Элемент, ИмяПоля);
	Если Значение = Неопределено Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Значение;

КонецФункции

Функция СтрокаИзПоля(Элемент, ИмяПоля)

	Значение = ЗначениеПоля(Элемент, ИмяПоля);
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат "";
	КонецЕсли;

	Возврат Строка(Значение);

КонецФункции

Функция ПредставлениеТипаТС(КодТипа)

	Если КодТипа = 1 Тогда
		Возврат "Легковой автомобиль";
	ИначеЕсли КодТипа = 2 Тогда
		Возврат "Бортовой грузовой";
	ИначеЕсли КодТипа = 3 Тогда
		Возврат "Седельный тягач";
	ИначеЕсли КодТипа = 4 Тогда
		Возврат "Автокран";
	ИначеЕсли КодТипа = 5 Тогда
		Возврат "Самосвал";
	ИначеЕсли КодТипа = 6 Тогда
		Возврат "Автовоз";
	ИначеЕсли КодТипа = 7 Тогда
		Возврат "Лесовоз";
	ИначеЕсли КодТипа = 8 Тогда
		Возврат "Пассажирский";
	ИначеЕсли КодТипа = 9 Тогда
		Возврат "Бульдозер";
	ИначеЕсли КодТипа = 10 Тогда
		Возврат "Экскаватор";
	ИначеЕсли КодТипа = 11 Тогда
		Возврат "Погрузчик";
	ИначеЕсли КодТипа = 12 Тогда
		Возврат "Топливозаправщик";
	ИначеЕсли КодТипа = 13 Тогда
		Возврат "Пожарная";
	ИначеЕсли КодТипа = 14 Тогда
		Возврат "Медицинский";
	ИначеЕсли КодТипа = 15 Тогда
		Возврат "Самолет";
	ИначеЕсли КодТипа = 16 Тогда
		Возврат "Вертолет";
	ИначеЕсли КодТипа = 17 Тогда
		Возврат "Дорожная техника";
	ИначеЕсли КодТипа = 18 Тогда
		Возврат "Человек";
	ИначеЕсли КодТипа = 19 Тогда
		Возврат "Доставка";
	ИначеЕсли КодТипа = 20 Тогда
		Возврат "Коммерческий";
	ИначеЕсли КодТипа = 21 Тогда
		Возврат "Технический";
	ИначеЕсли КодТипа = 0 Тогда
		Возврат "";
	КонецЕсли;

	Возврат Формат(КодТипа, "ЧГ=");

КонецФункции

Функция КоординатыСценыКарты(Широта, Долгота)

	Если Широта = 0 И Долгота = 0 Тогда
		Возврат Новый Структура("x,y", 0, 0);
	КонецЕсли;

	УТМ = КоординатыUTM32652(Широта, Долгота);
	ЛокальнаяX = УТМ.Easting - 734400;
	ЛокальнаяY = УТМ.Northing - 4774800;
	Радианы = -50 * 3.141592653589793 / 180;
	КоординатаX = ЛокальнаяX * Cos(Радианы) - ЛокальнаяY * Sin(Радианы);
	КоординатаY = ЛокальнаяX * Sin(Радианы) + ЛокальнаяY * Cos(Радианы);
	Возврат Новый Структура("x,y", КоординатаX, КоординатаY);

КонецФункции

Функция КоординатыUTM32652(ШиротаГрадусы, ДолготаГрадусы)

	ЧислоПи = 3.141592653589793;
	БольшаяПолуось = 6378137;
	Сжатие = 1 / 298.257223563;
	Эксцентриситет2 = Сжатие * (2 - Сжатие);
	ВторойЭксцентриситет2 = Эксцентриситет2 / (1 - Эксцентриситет2);
	Масштаб = 0.9996;
	ЦентральныйМеридиан = 129 * ЧислоПи / 180;
	Широта = ШиротаГрадусы * ЧислоПи / 180;
	Долгота = ДолготаГрадусы * ЧислоПи / 180;
	SinШирота = Sin(Широта);
	CosШирота = Cos(Широта);
	TanШирота = Tan(Широта);
	РадиусКривизны = БольшаяПолуось / Sqrt(1 - Эксцентриситет2 * SinШирота * SinШирота);
	КвадратТангенса = TanШирота * TanШирота;
	ПараметрC = ВторойЭксцентриситет2 * CosШирота * CosШирота;
	ДельтаДолготы = CosШирота * (Долгота - ЦентральныйМеридиан);
	Эксцентриситет4 = Эксцентриситет2 * Эксцентриситет2;
	Эксцентриситет6 = Эксцентриситет4 * Эксцентриситет2;
	ДугаМеридиана = БольшаяПолуось * (
		(1 - Эксцентриситет2 / 4 - 3 * Эксцентриситет4 / 64 - 5 * Эксцентриситет6 / 256) * Широта
		- (3 * Эксцентриситет2 / 8 + 3 * Эксцентриситет4 / 32 + 45 * Эксцентриситет6 / 1024) * Sin(2 * Широта)
		+ (15 * Эксцентриситет4 / 256 + 45 * Эксцентриситет6 / 1024) * Sin(4 * Широта)
		- (35 * Эксцентриситет6 / 3072) * Sin(6 * Широта));
	Дельта2 = ДельтаДолготы * ДельтаДолготы;
	Дельта3 = Дельта2 * ДельтаДолготы;
	Дельта4 = Дельта2 * Дельта2;
	Дельта5 = Дельта4 * ДельтаДолготы;
	Дельта6 = Дельта4 * Дельта2;
	Easting = Масштаб * РадиусКривизны * (ДельтаДолготы + (1 - КвадратТангенса + ПараметрC) * Дельта3 / 6
		+ (5 - 18 * КвадратТангенса + КвадратТангенса * КвадратТангенса + 72 * ПараметрC - 58 * ВторойЭксцентриситет2)
		* Дельта5 / 120) + 500000;
	Northing = Масштаб * (ДугаМеридиана + РадиусКривизны * TanШирота * (
		Дельта2 / 2 + (5 - КвадратТангенса + 9 * ПараметрC + 4 * ПараметрC * ПараметрC) * Дельта4 / 24
		+ (61 - 58 * КвадратТангенса + КвадратТангенса * КвадратТангенса + 600 * ПараметрC - 330 * ВторойЭксцентриситет2)
		* Дельта6 / 720));
	Возврат Новый Структура("Easting,Northing", Easting, Northing);

КонецФункции

#КонецОбласти

#КонецЕсли
